{"58":"X","64880967":"Stay up to date on discounts, new locations , and more by joining our email newsletter today.","645efc51":"About Us","4d34e0e4":"Welcome to the innovative world of Chiliboats, where we bring the unique and exhilarating experience of water cycling to the United States! As pioneers in this field, we are thrilled to introduce Chili boats to Philadelphia, our flagship location. Our tours offer a distinctive blend of adventure and relaxation, allowing you to explore the city's beautiful waterways while enjoying a vacation-like experience right in the heart of Philadelphia. ","137469f5":"With Chiliboats, you'll discover the city from a fresh perspective, combining the thrill of cycling with the serenity of floating on water. Whether you're a local looking for a new way to see your city or a tourist seeking an unforgettable experience, Chiliboats offers an exciting addition to Philadelphia's tourism scene. Join us for a journey that promises fun, fitness, and a unique way to connect with nature and the city's vibrant culture.","5c2b8a55":"Philadelphia","-13669d1e":"Book Now!","666d840f":"Get Chilli","157af343":"In Philly","332402e3":"Bring The Vaction To You.","1d5395f7":" Save on funds and multiply your fun with this Bahamian get away located in your back yard.","-76b7008a":"Ride Options","-7360a986":"Bikeboat Up","-4109c83":"See Specifications","11b48c92":"Dive into a unique blend of cycling and water sports with the Bikeboat Up. This innovative water bike combines the comfort of a traditional bicycle with the thrill of being on the water. Crafted with an aluminum structure and salt-water-resistant materials, it’s designed for durability and performance. With easy assembly in under 5 minutes and speeds up to 10 mph (16 km/h), the Bikeboat Up offers an exhilarating, eco-friendly ride. Perfect for solo adventures or fun with family and friends, choose from standard, big, and tandem models to suit your needs. Enjoy the ride, the fitness, and the serenity of nature with Bikeboat Up.","74b6c91":"Bikeboat Rec","-277fa9be":"Explore new horizons with the Bikeboat Rec, designed to maximize comfort and enjoyment on the water. Featuring a catamaran configuration and ergonomic seating, this water bike provides a stable and relaxing ride. With its aluminum structure, salt-water-resistant materials, and ultra-rugged inflatable floats, it's built for durability and performance. Easy to assemble in under 5 minutes and capable of speeds up to 10 mph (16 km/h), the Bikeboat Rec is perfect for leisurely rides or energetic adventures. Available in standard, big, and tandem models to suit every need.","-1a992ad6":"Bikeboat Tandem","-3a3ed7e9":"Share the adventure with the Bikeboat Tandem, the perfect water bike for two. With its catamaran design and ergonomic seating, this model offers stability and comfort on the water. Made with a durable aluminum structure and salt-water-resistant materials, it's built to last. Assembly takes less than 9 minutes, and it reaches speeds up to 10 mph (16 km/h). Ideal for couples, friends, or family, this tandem water bike brings twice the fun to your aquatic adventures.","-47761f27":"Newsletter","5a0ea5a1":"Thank you! Your submission has been received!","-7c112e99":"Oops! Something went wrong while submitting the form."}